In [1]:
# Loading libraries
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
print(string_data)

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull() # Check for sentinel value

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull() # again, check for sentinel value

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [6]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
print(data, '\n')
print(cleaned)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df = pd.DataFrame(np.random.randn(7, 3))
print(df)

          0         1         2
0 -0.931424  0.445261  0.689413
1  0.665435 -1.196695 -1.724078
2  0.029195 -1.176362  1.655855
3  0.389506  0.095660  0.985043
4  0.615768 -1.411578 -0.317185
5 -0.288349  2.224176  2.018170
6 -0.166206  1.364846  1.959249

In [14]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
print(df)

          0         1         2
0 -0.931424       NaN       NaN
1  0.665435       NaN       NaN
2  0.029195       NaN  1.655855
3  0.389506       NaN  0.985043
4  0.615768 -1.411578 -0.317185
5 -0.288349  2.224176  2.018170
6 -0.166206  1.364846  1.959249

In [15]:
df.dropna()

          0         1         2
4  0.615768 -1.411578 -0.317185
5 -0.288349  2.224176  2.018170
6 -0.166206  1.364846  1.959249

In [16]:
df.dropna(thresh=2)

          0         1         2
2  0.029195       NaN  1.655855
3  0.389506       NaN  0.985043
4  0.615768 -1.411578 -0.317185
5 -0.288349  2.224176  2.018170
6 -0.166206  1.364846  1.959249

In [17]:
df.fillna(0)

          0         1         2
0 -0.931424  0.000000  0.000000
1  0.665435  0.000000  0.000000
2  0.029195  0.000000  1.655855
3  0.389506  0.000000  0.985043
4  0.615768 -1.411578 -0.317185
5 -0.288349  2.224176  2.018170
6 -0.166206  1.364846  1.959249

In [18]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.931424  0.500000  0.000000
1  0.665435  0.500000  0.000000
2  0.029195  0.500000  1.655855
3  0.389506  0.500000  0.985043
4  0.615768 -1.411578 -0.317185
5 -0.288349  2.224176  2.018170
6 -0.166206  1.364846  1.959249

In [19]:
df.fillna(0, inplace=True)

In [20]:
df

          0         1         2
0 -0.931424  0.000000  0.000000
1  0.665435  0.000000  0.000000
2  0.029195  0.000000  1.655855
3  0.389506  0.000000  0.985043
4  0.615768 -1.411578 -0.317185
5 -0.288349  2.224176  2.018170
6 -0.166206  1.364846  1.959249

In [21]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.631981  1.031448 -0.206641
1 -0.433653  2.102438  1.339067
2  0.260378       NaN  0.908589
3  1.056487       NaN  0.096866
4  2.526341       NaN       NaN
5 -0.623645       NaN       NaN

In [22]:
df.fillna(method='ffill')

          0         1         2
0  1.631981  1.031448 -0.206641
1 -0.433653  2.102438  1.339067
2  0.260378  2.102438  0.908589
3  1.056487  2.102438  0.096866
4  2.526341  2.102438  0.096866
5 -0.623645  2.102438  0.096866

In [23]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.631981  1.031448 -0.206641
1 -0.433653  2.102438  1.339067
2  0.260378  2.102438  0.908589
3  1.056487  2.102438  0.096866
4  2.526341       NaN  0.096866
5 -0.623645       NaN  0.096866

In [24]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[:2, 1] = NA
df.iloc[:4, 2] = NA
df

          0         1         2
0  1.565544       NaN       NaN
1 -0.365113       NaN       NaN
2 -0.880208  0.777638       NaN
3 -0.087499  2.248699       NaN
4  0.267973  1.053783  0.841678
5 -0.516646  1.250886  0.701064

In [25]:
df.fillna(method='bfill')

          0         1         2
0  1.565544  0.777638  0.841678
1 -0.365113  0.777638  0.841678
2 -0.880208  0.777638  0.841678
3 -0.087499  2.248699  0.841678
4  0.267973  1.053783  0.841678
5 -0.516646  1.250886  0.701064

In [26]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [27]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [28]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
#data.drop_duplicates(inplace=True)

In [31]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [32]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [34]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [35]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [36]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
    }

In [37]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [38]:
data['animal'] = lowercased.map(meat_to_animal)

In [39]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [40]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [41]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [43]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [44]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [45]:
data.replace([-999, -1000], [np.nan, 0]) # List approach
data.replace({-999: np.nan, -1000: 0}) # Dict approach

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [46]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

In [47]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [48]:
transform = lambda x: x[:4].upper()

In [49]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [50]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [51]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [52]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [53]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [69]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [70]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [71]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [72]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [73]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [74]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [75]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [76]:
data = np.random.rand(20)
data

array([0.315591  , 0.41885198, 0.26193734, 0.46886364, 0.54201392,
       0.40989999, 0.09245908, 0.18262837, 0.52036389, 0.85046288,
       0.6865272 , 0.18836703, 0.27152107, 0.4869974 , 0.08347632,
       0.85023918, 0.50285534, 0.21424011, 0.93537289, 0.97101754])

In [79]:
cats = pd.cut(data, 4, precision=2)
pd.value_counts(cats)

(0.31, 0.53]     7
(0.083, 0.31]    7
(0.75, 0.97]     4
(0.53, 0.75]     2
dtype: int64

In [80]:
data = np.random.randn(1000)
data

array([ 2.58874406e-01, -8.63625479e-01, -2.30276372e+00, -1.01117397e-01,
       -1.50602258e+00, -1.22642186e+00, -8.52037072e-01,  2.34790406e-01,
        7.56720993e-01, -2.76976056e-02,  1.65954757e+00, -1.46326742e+00,
        1.05173414e+00,  3.63280000e-01,  5.76397035e-01,  6.96360927e-01,
       -4.46895917e-01, -1.33723556e-01, -7.64251671e-01,  8.51233058e-01,
       -1.34403445e+00,  1.68693861e+00, -1.39186489e+00,  7.57793845e-02,
       -1.87419940e+00,  2.20773331e-01, -1.49567994e-01,  1.23378348e+00,
       -7.23745751e-01, -8.18006787e-02,  2.50921863e-01, -9.38332286e-01,
        9.46718932e-01,  2.54207063e-01, -9.76487557e-01,  9.54107750e-01,
       -2.21523356e+00, -6.65712837e-01,  5.72538153e-01, -7.01617190e-01,
        1.11642223e+00, -6.31121752e-01, -1.09205891e+00,  6.55962239e-01,
       -8.70818148e-02, -1.66423023e+00,  5.50698402e-02, -1.29364570e+00,
       -6.43769971e-01,  1.73741531e+00, -1.91573003e+00,  2.40327761e-01,
        1.31370615e+00, -3.21076817e-01,  1.26510303e+00,  1.20235515e+00,
        5.47186472e-02,  7.57152177e-01,  8.58893465e-01, -1.52933474e+00,
        1.37783307e+00, -5.23566245e-03,  1.86331496e+00, -6.62921670e-01,
        1.02076272e-01,  3.14010921e-01, -8.64983970e-01,  5.26069620e-01,
       -1.42547212e+00,  8.57102118e-01,  1.80915976e+00,  7.99491038e-01,
        9.22226753e-01,  1.17469333e+00,  8.45837341e-01, -1.51891427e+00,
        1.46437561e+00,  9.43900761e-01,  2.67128126e+00, -1.65843383e+00,
       -2.74241056e-01, -4.43528315e-01,  1.49683089e+00, -1.53433040e-01,
        9.54570137e-01, -5.54065324e-01, -4.59582452e-01, -1.38041898e+00,
        1.05283843e+00, -5.85128849e-01,  1.28110807e+00,  4.08391398e-01,
        3.43863132e-02,  1.12658232e+00,  1.09352361e+00, -5.19874644e-01,
        1.68836427e-01, -8.02979053e-02,  1.25968379e-01, -1.86527246e+00,
        1.30934044e-01,  1.43277070e+00, -9.68564778e-01,  2.62049143e-01,
       -1.42069669e+00, -2.22161454e+00,  1.08134750e-01, -4.91986790e-01,
        2.39439563e-01,  1.05780274e+00, -5.44781981e-01,  8.07442324e-01,
       -3.01199292e-01, -7.46248715e-01, -3.22021090e-01, -4.10524311e-02,
        1.40685764e+00, -1.48827534e+00,  9.75299094e-01, -1.60539546e+00,
        1.66033661e+00, -9.62224464e-01,  3.77252972e-01, -7.29021018e-01,
        7.57177197e-01, -2.81700542e-01, -7.93860191e-01, -4.53345347e-01,
       -1.48822388e+00,  1.62268099e+00, -1.30963376e+00, -5.82645309e-01,
        6.39450324e-01, -4.18158621e-02, -1.00129746e+00,  1.46185241e+00,
        8.86107092e-01,  9.90129147e-01,  1.88881119e+00,  6.86544737e-01,
       -9.47906321e-01,  9.75388411e-01,  5.64023916e-01,  3.41227466e-01,
       -1.17501193e+00, -7.02570842e-01,  1.36888306e+00, -5.79738887e-02,
       -4.56340824e-01, -1.43834435e+00,  2.33809502e-01,  5.10591879e-02,
        1.45998658e+00,  1.18431148e+00, -7.47845619e-01,  6.91768877e-01,
       -4.82207936e-01, -2.81224432e+00, -6.69819336e-01, -1.24907930e+00,
       -2.66159859e+00,  6.62078707e-01, -1.38533391e+00, -2.15991811e+00,
       -2.15934032e-01, -5.87341800e-01,  1.05284689e+00,  3.33960569e-01,
       -1.77948838e+00, -1.62655917e-01,  5.18679558e-01,  8.34308552e-01,
        4.49128544e-01, -1.00186975e+00, -2.25615024e+00, -2.27564652e+00,
        2.09680068e-01,  1.59168054e+00, -4.96884237e-01, -2.78412463e-01,
        4.61108134e-01,  2.89279013e+00,  1.17976707e+00, -3.28712628e-01,
       -2.21340576e+00,  8.85438529e-01,  8.09283378e-01,  1.58639859e+00,
       -5.96156041e-01,  9.61916735e-02, -1.09642464e+00, -1.34169291e+00,
        1.02610360e+00, -1.17897976e+00,  1.34013756e+00,  1.18265552e-01,
        8.17457382e-01, -5.09759701e-03,  5.92079312e-01, -4.13979108e-01,
        7.23320364e-02, -5.06880507e-01, -1.06462340e+00,  5.28244645e-01,
        1.38864240e+00, -1.47933348e+00,  3.01251923e-01,  1.23979920e+00,
       -4.59812154e-01, -6.67245870e-01, -4.35771616e-01, -6.48311371e-01,
        9.83593238e-02, -3.94849213e-01,  5.92863513e-02, -8.05370897e-01,
       -2.18437937e+00,  1.10632321e+00,  6.91481827e-01, -1.06347443e+00,
        1.03823081e+00,  1.12581459e+00, -7.35099883e-01,  1.27280803e+00,
       -5.19939114e-01, -1.14992929e+00,  5.15103244e-01,  1.48064324e+00,
       -1.18415493e+00, -1.88949145e-01, -1.35767309e+00,  5.63187857e-01,
       -1.74783797e+00,  8.86470421e-01,  3.26965038e-01,  8.97208378e-01,
        3.75616717e-01,  3.47057963e-01,  2.06957407e-01,  1.00785749e+00,
       -6.26208251e-01, -2.00845805e+00,  1.45505623e+00,  6.35021793e-01,
        2.57663771e-01, -2.53861595e+00,  1.22562882e+00,  8.18444574e-01,
       -5.03406070e-01, -6.10445567e-01, -1.16797228e-01,  1.51391036e+00,
       -9.32339805e-01, -8.64342196e-01,  7.94355369e-01,  3.19365440e-01,
       -1.15139979e+00,  4.01848466e-01,  7.37440612e-02,  3.22635256e-01,
        1.24956934e+00, -2.85583014e+00, -1.84044383e-01,  2.23194220e+00,
        5.80578954e-01, -5.56493199e-02, -1.30260716e-01,  3.93647712e-01,
        6.98768205e-01,  2.88506201e-01, -6.04590825e-01,  4.13962978e-01,
        2.15552200e+00,  3.57665683e-02,  7.61935777e-01, -3.46778076e-01,
        5.04229316e-01,  2.33609272e-01, -4.36851863e-02, -7.00988579e-02,
       -8.13186675e-01, -2.91446996e-01,  5.03339562e-01, -1.17447077e+00,
        2.37163429e-02, -1.52073247e-02, -1.22002923e+00, -3.01570133e-01,
       -1.25452647e-02,  5.23653838e-01,  7.66300240e-01, -5.13968616e-01,
        4.75116640e-01,  3.22923151e-01,  6.46680669e-01,  1.75778912e+00,
        1.09720680e+00,  3.88388607e-02,  1.03675617e+00,  2.74037052e-02,
        5.49598870e-01, -6.77025057e-02,  4.14644373e-01, -1.37759135e-01,
       -8.33256364e-01,  1.78365541e-01, -7.58126873e-01,  1.89484987e-01,
        2.01368491e+00,  9.53953466e-01, -4.40288361e-01,  1.37779532e+00,
       -2.44508343e-01, -5.40707709e-01, -7.27664372e-01, -3.46466688e-01,
        9.38588180e-01, -1.09058670e+00, -2.19018324e-01, -4.12700927e-01,
        1.00184674e+00, -1.09525192e+00, -1.23027570e+00, -1.02744441e+00,
       -2.22013545e-01, -8.78736083e-01, -1.20041535e+00, -2.53920493e-01,
       -1.46825100e+00, -6.70171970e-01,  2.41888844e+00, -2.71084442e-01,
        1.66143285e+00,  9.68756026e-01, -1.77676810e-01,  1.50137959e+00,
        1.31547873e+00,  6.70137952e-01, -4.21378777e-02, -6.14693889e-01,
       -2.50938918e+00,  3.00967682e-02,  1.16319264e+00, -6.23927865e-01,
       -3.53833654e-02, -1.83529317e+00, -1.12577507e+00,  8.06037499e-01,
       -9.69493134e-01,  6.58907270e-01, -8.00518941e-01, -1.06838940e+00,
       -7.49765091e-01, -1.37174584e-01, -5.67455856e-01,  1.70047425e+00,
       -1.17191569e+00,  2.23589869e+00, -7.59410126e-01, -6.89066183e-01,
        2.66795354e-01, -9.15567168e-01,  6.49748068e-01, -1.86475481e+00,
        6.22360531e-01,  1.05540947e+00,  4.33946333e-01,  6.72607081e-01,
       -6.43235616e-01, -1.16932162e+00, -6.27748860e-01, -3.00405307e-01,
       -6.72743741e-02, -1.37633497e+00,  3.33678474e-01,  1.19629183e+00,
       -8.11838797e-01,  7.31245498e-01, -6.68943883e-01,  2.46550313e+00,
       -6.47393468e-02, -8.94475468e-02,  1.35719318e-01, -4.97209777e-01,
       -8.32692241e-01,  3.12083963e-01, -1.27768740e-01,  3.76859227e-01,
       -6.57919920e-01, -2.71911262e-01,  7.20396444e-01, -2.08915323e-02,
        9.96760502e-01,  1.10059021e+00, -6.54224983e-01, -3.89775484e-01,
       -4.13196360e-01,  2.34128250e-01,  5.85936370e-01,  1.44785687e+00,
        5.06909746e-01, -2.35765109e-01, -8.60045092e-01,  1.75839498e+00,
       -3.10441238e-01, -7.73392573e-01, -2.07055573e-01, -4.52354341e-01,
       -3.80954633e-01, -1.08638317e+00, -1.80121512e+00, -2.41854586e-01,
        3.90148982e-01, -1.85349765e-01, -4.03103366e-01,  7.49672878e-01,
        8.02727101e-01, -5.60762447e-01,  1.71105400e+00,  7.21934289e-02,
       -1.24837335e-01, -1.76801815e+00,  2.39752613e-01,  1.14087414e-01,
       -5.08620083e-01, -4.72934640e-01, -1.35912777e+00,  1.24429057e+00,
        7.92345233e-01, -2.12262072e+00, -8.90083026e-02,  7.83820389e-02,
       -2.37804956e-01,  1.04199458e+00,  1.86220525e-01,  1.88989190e+00,
       -8.94331290e-01,  2.23318035e+00, -5.47765466e-01,  4.05330926e-01,
       -1.87165139e+00,  2.03549353e-01,  3.55052820e-01,  2.06614266e+00,
        1.77346729e-01,  1.07233504e+00,  9.00997321e-01, -5.01473509e-01,
        2.95376313e-01,  9.05813690e-03, -3.05090970e-01,  3.21364068e-01,
        1.68324812e+00,  6.00677197e-01, -1.18003718e+00,  5.72844835e-03,
        3.91597548e-01,  7.76760165e-02,  1.29312633e+00,  1.61341542e+00,
        2.58079959e-03, -1.31596040e+00, -1.08461716e+00, -8.27611430e-01,
       -2.99207490e-01, -5.34951907e-01, -4.39754296e-01,  2.16017183e-01,
       -5.58896515e-02, -2.02301620e-02,  9.16949835e-01,  1.33141778e-01,
        6.74524907e-01,  1.38907266e-01,  1.72356696e+00, -7.70593763e-01,
       -1.29594766e+00, -2.06754837e-01, -1.27590657e+00, -5.28341186e-01,
        1.02046226e-01,  7.10636006e-01, -7.50082819e-02, -6.66925765e-01,
        6.61873358e-01, -8.87443552e-01, -3.15287221e-01, -2.34185004e+00,
       -8.15314857e-01, -1.79916493e+00, -1.71785612e+00, -6.42707062e-01,
        1.12696773e+00,  4.95351965e-01, -3.64488736e-01,  1.02776847e+00,
       -7.66963879e-01, -1.71662267e+00,  1.98289803e+00, -1.11863997e+00,
       -1.44531167e+00,  9.11556318e-01, -1.38563930e+00, -1.25388051e+00,
       -7.88742994e-01,  2.68503796e+00,  6.61906808e-01,  1.29221624e+00,
        3.11909739e+00,  3.18142868e+00, -1.01228723e+00, -5.64881824e-02,
        1.29037200e+00,  1.60223298e-01,  3.68420067e-01,  6.67912406e-02,
        2.24554272e+00,  6.54041441e-01, -1.53417523e+00, -1.98257620e+00,
        8.46932765e-01,  1.01631726e-03, -2.17567105e+00,  9.18055124e-01,
        4.69619631e-01,  1.21636084e+00,  9.21903509e-01, -6.36001896e-02,
        3.84500188e-01,  9.58584319e-01,  9.00084570e-01, -7.43675099e-01,
        5.64241479e-02,  9.07996005e-01,  1.67997238e-02, -2.12573038e+00,
        6.49850852e-01, -1.32396686e-02, -6.34901540e-01,  6.75838826e-01,
       -4.78976480e-01,  4.72703064e-01, -7.48994386e-01,  1.28775893e+00,
       -1.57058438e-01,  1.13174878e+00, -1.18880753e+00,  3.21039729e-02,
        3.84712853e-01, -4.73628480e-01,  2.87554346e-01,  1.13360630e+00,
        2.48680339e-01, -1.75538319e-01, -4.30559754e-01,  2.29999854e+00,
       -1.36220077e+00, -4.39696066e-01, -3.24793336e-01, -4.89951728e-01,
        7.49855377e-01,  3.85337506e-01, -9.12891665e-01,  8.80769246e-01,
        5.69873231e-01,  9.00668863e-01, -1.65831747e-01,  1.67590948e+00,
        5.68159902e-01, -9.17076030e-01,  8.23124118e-01, -7.87864898e-02,
        9.88489886e-01, -1.24636261e+00,  9.68044680e-01, -5.52903522e-01,
        1.38112509e+00,  1.03760222e+00, -7.46069319e-01,  4.98417786e-02,
        1.33033566e+00, -1.68724221e+00,  1.56362291e+00,  1.07532396e+00,
       -3.07018137e-01, -1.03090584e+00, -7.91267668e-01,  6.86653604e-01,
       -5.56261715e-04,  4.92801278e-02, -9.99440891e-01,  2.47170562e-01,
        7.09595414e-01, -5.52104713e-01,  7.30091849e-01, -6.50980647e-01,
        8.11806285e-01, -2.03940962e+00,  6.59849090e-01, -7.45167292e-01,
       -4.52684127e-01,  3.87546032e-01, -8.00361583e-01,  8.03671659e-01,
        8.79866680e-02, -9.42836741e-01, -2.99782389e-01, -1.73527174e+00,
        4.49472551e-03, -1.19502461e+00, -3.72447152e-01,  1.02203917e+00,
        4.26107686e-01,  8.60023273e-01,  2.51361883e-01, -2.61689817e-01,
       -6.96623310e-01, -1.12848857e+00, -3.81340546e-01,  6.75162608e-01,
       -7.57708273e-01, -3.02813387e-01,  2.02233840e+00, -8.75886888e-01,
        1.38619094e+00,  5.41483915e-01,  2.45491339e-01,  7.74909522e-02,
        4.20245010e-01,  8.88904637e-01,  9.25675922e-01, -1.30841433e+00,
        3.06840411e-01, -1.67770358e+00, -1.13808455e+00, -7.81658660e-01,
        4.18367277e-01, -1.02159340e-01, -5.32172592e-02,  2.74601792e-01,
        1.59813431e+00, -1.39932114e+00, -1.52515367e+00,  8.07141181e-01,
        1.79727736e-01, -1.35295179e+00, -1.19704159e+00, -6.52866644e-01,
        9.13907955e-01, -2.35568335e-01,  2.66920264e-01,  1.57923276e+00,
        3.22213373e-01, -1.45380695e-01, -1.20086196e+00, -1.38096644e+00,
       -1.11444850e+00,  9.17796862e-02,  2.20675752e-01,  2.43866618e+00,
        1.63912537e-01, -1.58839575e+00, -7.31407935e-01, -1.79045823e+00,
        3.85365725e-01,  1.92432604e+00,  4.65641221e-01, -1.23946385e+00,
       -3.03848020e-01,  1.61225470e+00,  1.02914568e+00, -5.31866502e-01,
        2.22807695e+00,  5.92388376e-01,  2.80194977e-01, -4.14361493e-01,
        8.12034096e-01, -3.76010835e-02,  1.69714314e-02, -1.12174370e+00,
       -3.28881059e-01,  3.11812867e-01, -8.91396836e-01,  1.70356606e-01,
       -1.14208272e+00,  3.54129333e-01,  2.41272105e-01, -4.02601091e-01,
       -2.60815516e-01,  1.38471539e-01, -2.87191583e-02, -1.66123809e+00,
       -7.60473660e-01, -1.66048472e+00, -3.76918066e-01,  1.38836351e+00,
       -7.48735140e-01,  1.02582197e+00, -2.31916807e+00, -2.16971612e-01,
        1.41487169e+00, -1.65725329e+00,  1.40148647e+00,  2.78850733e-01,
        9.43079743e-01, -1.83091986e-01, -3.22584142e-01,  6.82073543e-01,
       -2.30152241e-01,  2.46366899e-01, -1.19487913e+00,  1.86383073e+00,
        5.05357954e-01, -1.55923201e-01,  8.70676555e-01,  1.11599070e+00,
       -2.04754555e+00,  9.83044366e-01, -6.74276327e-01,  4.34929935e-01,
       -1.59229369e+00, -1.23957224e-01,  1.64441853e+00,  2.09029266e-03,
        2.23469500e-01, -1.20863217e+00,  1.03598799e+00,  3.76429919e-01,
        5.21311749e-01,  1.68169217e+00,  6.43165089e-01,  1.84365898e-01,
       -7.83066694e-02,  1.31886831e+00, -1.98104746e+00, -6.74778518e-01,
        2.27508598e-01,  5.69318104e-01,  1.81721060e-01, -9.78538557e-01,
        7.67215275e-01, -8.61941970e-01, -6.67636639e-01, -1.09037978e+00,
        7.61290898e-01,  8.58482067e-02,  1.10388386e+00, -1.91763839e+00,
        5.72007286e-01, -6.70261598e-01, -1.34923111e+00, -5.57514282e-01,
        2.28015733e+00,  6.41174053e-01,  2.68976649e+00,  2.56466142e+00,
       -4.62790055e-01, -1.13324065e-01, -1.94117970e-02, -1.97591089e+00,
       -9.75319228e-01, -1.55026912e-01, -1.37850937e+00,  2.90101603e-01,
       -5.90699302e-01, -2.02247339e+00, -5.64656569e-01, -7.44662013e-02,
        7.17950010e-02, -1.00658258e+00,  8.07239014e-01, -1.26398200e+00,
       -2.00532687e-02,  1.08714794e+00, -1.25762535e-01, -3.53378929e-01,
        5.98823997e-01, -5.47031985e-01, -7.89460011e-01,  1.65343169e+00,
       -8.02213693e-01,  6.80537531e-01, -5.73941091e-01,  1.68829799e-01,
        9.69290877e-01,  2.26941189e-01,  7.76628423e-02,  4.77257286e-01,
        2.30720887e-01,  2.11470057e-01,  1.03907205e+00, -2.85141146e+00,
        1.98828517e-01, -3.19316295e-01,  1.08940563e+00,  7.64721014e-03,
        2.94713329e-01,  6.44534478e-01,  9.40507438e-01, -1.24212039e+00,
        1.24338665e+00,  1.34716333e+00, -4.85859660e-01,  8.35025664e-01,
       -2.51631870e-02, -3.49299616e-01,  6.52010272e-02, -4.29066750e-01,
       -2.34552245e-01,  2.82527516e-01,  8.87954410e-01, -6.56663796e-02,
        2.10708547e-01,  4.97020340e-02,  6.77291015e-01, -4.64412710e-02,
        3.30711775e-01,  2.49104682e-01, -8.10471648e-01, -1.68449359e+00,
       -1.07013296e+00,  8.99769684e-01, -7.13316564e-01,  1.24833187e-01,
        2.98286396e-01, -5.64544243e-01,  9.30085271e-01, -5.01883156e-01,
        1.64499656e+00,  5.60613323e-01,  8.83539720e-01,  1.77554538e-01,
        1.34278602e-01, -3.44357976e-01, -1.08021827e-01, -1.83359774e+00,
       -8.52910023e-01, -3.42551899e-01, -3.85086687e-02, -1.37027281e+00,
        1.76161165e-01,  1.15016523e+00, -4.43310038e-01,  1.15833145e+00,
        4.79222859e-01,  1.93169520e+00, -1.50851310e+00, -2.36723605e-01,
        1.76286877e+00,  6.06037775e-01,  3.23301566e-01, -9.47445017e-01,
       -8.79486279e-01,  1.29212929e+00, -5.13549026e-01,  1.05570516e+00,
        1.05859911e+00,  4.04387737e-01,  3.75106342e-01,  1.45627589e+00,
        3.23880486e-01,  1.49680333e+00, -1.30483195e-01, -5.40012356e-01,
       -1.06320552e+00, -1.00100494e+00,  8.36307815e-01,  8.82437174e-01,
        5.27027958e-01,  5.76543085e-01, -5.42747172e-01,  7.79392421e-01,
        1.52866670e+00,  3.63313586e-01,  3.80136289e-01, -2.92458910e-02,
        2.10728560e-02, -5.84487707e-02,  7.87715343e-01, -1.59447066e-01,
        1.16746431e+00,  1.48474912e+00, -1.96387074e+00,  4.27407041e-01,
       -1.27929061e+00,  1.53751832e+00,  4.22997087e-01,  4.23052292e-01,
       -7.14727116e-01, -2.07429321e+00,  9.34629615e-01, -1.80344245e+00,
        6.01806142e-01, -7.52941900e-01, -7.49218654e-01, -2.22977136e+00,
        2.27990058e-01, -1.21750738e+00, -7.69221767e-02,  8.98259516e-01,
        1.01691863e+00,  1.11980990e+00,  1.31310527e-01,  2.17013507e-01,
       -1.41840800e-01,  3.21798696e-01, -8.19345963e-01, -3.99588261e-01,
        1.00349205e+00, -2.19020844e+00,  1.59542536e+00, -2.75807470e-01,
       -1.25772638e-01,  7.75903704e-01,  1.82042484e+00,  9.90931256e-01,
       -5.73551472e-01, -6.90139868e-01, -3.48043963e-01, -8.66104905e-01,
        1.09085786e+00,  4.06007060e-01, -4.72936499e-01, -8.45209314e-01,
        4.26453683e-01, -8.10978375e-01, -1.23869543e+00,  2.10011463e-01,
       -3.18387956e-01,  1.74782820e-01,  5.47420378e-01, -2.22879985e+00,
        2.53801486e+00,  5.94897999e-01,  1.06333091e-01, -2.17183237e-01,
       -1.10038868e+00, -1.33022828e+00, -2.96322982e+00,  1.59989113e+00,
        1.86390651e-01,  1.14190994e+00,  5.56687020e-01,  9.65816606e-01,
        1.71326292e+00,  8.65949538e-02,  1.28875000e+00, -8.30733448e-01,
       -1.41599514e+00, -4.45905869e-01, -7.81495571e-01,  4.80587658e-01,
        6.88017830e-01, -2.19182670e+00,  1.12577798e+00,  1.06878548e+00,
        7.63986117e-01,  1.46810627e+00,  1.15265787e+00,  3.88772290e-01,
       -1.33612665e+00,  5.85198863e-01,  1.49896043e+00, -3.17667253e-01,
       -6.14284686e-01, -2.22608084e-01, -1.20478051e+00,  7.24549480e-02,
       -7.32494505e-02,  6.97498537e-01,  1.88483302e+00,  4.36008867e-01,
        1.80948667e-01,  7.35396313e-01,  1.67788185e-01,  1.87136124e+00,
       -1.31325655e+00, -1.68450684e-02,  2.59749411e+00,  1.53479749e+00,
        1.00268318e-01, -1.00709800e+00, -4.71684431e-01, -9.81415758e-01,
        9.19560817e-01, -6.19387180e-01,  8.01170811e-01,  1.48299714e+00,
       -3.52945497e+00,  9.92131640e-01,  3.17881689e-02, -2.11131879e+00,
        1.06698378e+00,  2.43195922e-01,  7.17595319e-01, -2.07602106e-01,
       -5.48182731e-02, -1.05985909e+00, -1.10271760e-01,  5.83288700e-01])

In [81]:
cats = pd.qcut(data, 4)
cats

[(0.0495, 0.752], (-3.53, -0.668], (-3.53, -0.668], (-0.668, 0.0495], (-3.53, -0.668], ..., (-0.668, 0.0495], (-0.668, 0.0495], (-3.53, -0.668], (-0.668, 0.0495], (0.0495, 0.752]]
Length: 1000
Categories (4, interval[float64]): [(-3.53, -0.668] < (-0.668, 0.0495] < (0.0495, 0.752] < (0.752, 3.181]]

In [82]:
pd.value_counts(cats)

(0.752, 3.181]      250
(0.0495, 0.752]     250
(-0.668, 0.0495]    250
(-3.53, -0.668]     250
dtype: int64

In [84]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
cats

[(0.0495, 1.291], (-1.31, 0.0495], (-3.53, -1.31], (-1.31, 0.0495], (-3.53, -1.31], ..., (-1.31, 0.0495], (-1.31, 0.0495], (-1.31, 0.0495], (-1.31, 0.0495], (0.0495, 1.291]]
Length: 1000
Categories (4, interval[float64]): [(-3.53, -1.31] < (-1.31, 0.0495] < (0.0495, 1.291] < (1.291, 3.181]]

In [85]:
pd.value_counts(cats)

(0.0495, 1.291]    400
(-1.31, 0.0495]    400
(1.291, 3.181]     100
(-3.53, -1.31]     100
dtype: int64

In [91]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0    0.486968 -1.083656  1.277137  0.122177
1    0.397829 -1.424641 -0.014910  0.273817
2    1.338118  0.080112 -0.493964 -0.295947
3   -1.055828  1.507248 -1.212898  0.938595
4   -1.172598 -1.483111 -0.266436  0.024433
..        ...       ...       ...       ...
995  0.837263 -1.363698  0.487379 -0.637349
996  1.518945  0.061126  0.506283 -1.564272
997 -0.903585 -0.179685 -1.712567  0.191812
998 -2.157396  1.031951 -0.768216  1.111862
999  0.059612  0.854164  0.579471  0.732392

[1000 rows x 4 columns]

In [92]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.002728     0.009648    -0.039414    -0.017802
std       0.959128     1.002432     0.994127     1.034712
min      -2.763524    -2.821876    -3.161491    -3.441682
25%      -0.693488    -0.735367    -0.718105    -0.724959
50%       0.012093     0.035099    -0.018008    -0.023798
75%       0.664105     0.729981     0.633069     0.653642
max       2.722078     2.951629     2.993418     2.782595

In [93]:
col = data[2]

In [96]:
col[np.abs(col) > 3]

122   -3.161491
787   -3.112835
Name: 2, dtype: float64

In [97]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
122  0.019350 -0.501194 -3.161491 -1.898137
787  0.515586  1.713387 -3.112835  0.482029
845  0.827370  0.987402  1.376020 -3.441682

In [100]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.002728     0.009648    -0.039140    -0.017360
std       0.959128     1.002432     0.993289     1.033342
min      -2.763524    -2.821876    -3.000000    -3.000000
25%      -0.693488    -0.735367    -0.718105    -0.724959
50%       0.012093     0.035099    -0.018008    -0.023798
75%       0.664105     0.729981     0.633069     0.653642
max       2.722078     2.951629     2.993418     2.782595

In [101]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1  1.0 -1.0 -1.0  1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4 -1.0 -1.0 -1.0  1.0

In [104]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [105]:
sampler = np.random.permutation(5)
sampler

array([4, 0, 3, 1, 2])

In [106]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [107]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3

In [108]:
choices = pd.Series([5, 7, -1, 6, 4])

In [112]:
draws = choices.sample(n=10, replace=True)
draws

3    6
0    5
0    5
2   -1
2   -1
2   -1
2   -1
1    7
2   -1
4    4
dtype: int64

In [114]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [115]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [117]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [119]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [123]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [124]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [127]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [128]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [129]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [130]:
'::'.join(pieces)

'a::b::guido'

In [131]:
'guido' in val

True

In [132]:
val.index(',')

1

In [133]:
val.find(':')

-1

In [134]:
val.index(':')

ValueError: substring not found

In [135]:
val.count(',')

2

In [136]:
val.replace(',', '::')

'a::b:: guido'

In [137]:
val.replace(',', '')

'ab guido'

In [139]:
import re

text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [140]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [141]:
regex.findall(text)

[' ', '\t ', ' \t']

In [142]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags=re.IGNORECASE)

In [143]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [144]:
m = regex.search(text)
m

In [145]:
text[m.start():m.end()]

'dave@google.com'

In [146]:
print(regex.match(text))

None

In [147]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [149]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [150]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [151]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com